In [41]:
import pandas as pd
students = pd.read_csv('D:\Костя\Downloads\StudentsPerformance.csv') #читаем табличку
dota_hero = pd.read_csv('D:\Костя\Downloads\dota_hero_stats.csv')
dota_hero

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini..."
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"
...,...,...,...,...,...,...,...,...
112,112,Melee,114,2,Monkey King,npc_dota_hero_monkey_king,agi,"['Carry', 'Escape', 'Disabler', 'Initiator']"
113,113,Ranged,119,2,Dark Willow,npc_dota_hero_dark_willow,int,"['Support', 'Nuker', 'Disabler', 'Escape']"
114,114,Melee,120,2,Pangolier,npc_dota_hero_pangolier,agi,"['Carry', 'Nuker', 'Disabler', 'Durable', 'Esc..."
115,115,Ranged,121,2,Grimstroke,npc_dota_hero_grimstroke,int,"['Support', 'Nuker', 'Disabler', 'Escape']"
116,116,Melee,129,2,Mars,npc_dota_hero_mars,str,"['Carry', 'Initiator', 'Disabler', 'Durable']"

In [47]:
students.aggregate({'math score': 'mean', 'reading score': 'mean'})

math score       1000.000
reading score      69.169
dtype: float64

In [3]:
#найдем средние значения ключевых переменных в зависимости от пола
#сгруппируем датасет по группирующей переменной - полу
#в каждой группе найдем среднее значание
students.groupby('gender').mean()

        math score  reading score  writing score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

In [9]:
students.groupby('gender').aggregate({'math score': 'mean', 'reading score': 'mean'})

        math score  reading score
gender
female   63.633205      72.608108
male     68.728216      65.473029

In [17]:
students.groupby('gender', as_index = False).aggregate({'math score': 'mean', 'reading score': 'mean'})

   gender  math score  reading score
0  female   63.633205      72.608108
1    male   68.728216      65.473029

In [12]:
students.groupby(['gender', 'race/ethnicity'], as_index = False).aggregate({'math score': 'mean'})

   gender race/ethnicity  math score
0  female        group A   58.527778
1  female        group B   61.403846
2  female        group C   62.033333
3  female        group D   65.248062
4  female        group E   70.811594
5    male        group A   63.735849
6    male        group B   65.930233
7    male        group C   67.611511
8    male        group D   69.413534
9    male        group E   76.746479

In [37]:
#найдем топ 5 математиков девушек и топ 5 математиков юношей
#отсортируем по результатам теста по математике и по полу
#ascending - по возрастанию
#сгрупируем по полу
#к каждой группе приеним head()

students.sort_values(['gender', 'math score'], ascending = False).groupby('gender').head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100
306,male,group E,some college,standard,completed,99,87,81
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
263,female,group E,high school,standard,none,99,93,90

In [49]:
#Пересчитаем число ног у героев игры Dota2! Сгруппируйте героев из датасэта по числу их ног (колонка legs), и заполните их число в задании ниже.
dota_hero.groupby('legs').aggregate({'id': 'count'}) #count - количество

      id
legs
0     11
2     95
4      7
6      3
8      1